IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_ECC_AGGR.xml
<module name="PRU_ICSSG1_ECC_AGGR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="BORG_ECC_AGGR__CFG__REGS_aggr_revision" acronym="BORG_ECC_AGGR__CFG__REGS_aggr_revision" offset="0x0" width="32" description="Revision parameters">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29 - 28" rwaccess="R"/> 
		<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1696" description="Module ID" range="27 - 16" rwaccess="R"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x29" description="RTL version" range="15 - 11" rwaccess="R"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7 - 6" rwaccess="R"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x0" description="Minor version" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_ecc_vector" acronym="BORG_ECC_AGGR__CFG__REGS_ecc_vector" offset="0x8" width="32" description="ECC Vector Register">
		<bitfield id="RD_SVBUS_DONE" width="1" begin="24" end="24" resetval="0x0" description="Status to indicate if read on serial VBUS is complete, write of any value will clear this bit." range="24" rwaccess="R/W1TC"/> 
		<bitfield id="RD_SVBUS_ADDRESS" width="8" begin="23" end="16" resetval="0x0" description="Read address" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="RD_SVBUS" width="1" begin="15" end="15" resetval="0x0" description="Write 1 to trigger a read on the serial VBUS" range="15" rwaccess="R/W1TS"/> 
		<bitfield id="ECC_VECTOR" width="11" begin="10" end="0" resetval="0x0" description="Value written to select the corresponding ECC RAM for control or status" range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_misc_status" acronym="BORG_ECC_AGGR__CFG__REGS_misc_status" offset="0xC" width="32" description="Misc Status">
		<bitfield id="NUM_RAMS" width="11" begin="10" end="0" resetval="0x9" description="Indicates the number of RAMS serviced by the ECC aggregator" range="10 - 0" rwaccess="R"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_sec_eoi_reg" acronym="BORG_ECC_AGGR__CFG__REGS_sec_eoi_reg" offset="0x3C" width="32" description="EOI Register">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_sec_status_reg0" acronym="BORG_ECC_AGGR__CFG__REGS_sec_status_reg0" offset="0x40" width="32" description="Interrupt Status Register 0">
		<bitfield id="PR1_PDSP_TX1_IRAM_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for pr1_pdsp_tx1_iram_pend" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP_TX0_IRAM_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for pr1_pdsp_tx0_iram_pend" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RTU1_IRAM_ECC_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for pr1_rtu1_iram_ecc_pend" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RTU0_IRAM_ECC_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for pr1_rtu0_iram_ecc_pend" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RAM_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for pr1_ram_pend" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP1_IRAM_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for pr1_pdsp1_iram_pend" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP0_IRAM_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for pr1_pdsp0_iram_pend" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_DRAM1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for pr1_dram1_pend" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_DRAM0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for pr1_dram0_pend" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_sec_enable_set_reg0" acronym="BORG_ECC_AGGR__CFG__REGS_sec_enable_set_reg0" offset="0x80" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="PR1_PDSP_TX1_IRAM_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for pr1_pdsp_tx1_iram_pend" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP_TX0_IRAM_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for pr1_pdsp_tx0_iram_pend" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RTU1_IRAM_ECC_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for pr1_rtu1_iram_ecc_pend" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RTU0_IRAM_ECC_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for pr1_rtu0_iram_ecc_pend" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RAM_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for pr1_ram_pend" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP1_IRAM_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for pr1_pdsp1_iram_pend" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP0_IRAM_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for pr1_pdsp0_iram_pend" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_DRAM1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for pr1_dram1_pend" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_DRAM0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for pr1_dram0_pend" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_sec_enable_clr_reg0" acronym="BORG_ECC_AGGR__CFG__REGS_sec_enable_clr_reg0" offset="0xC0" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="PR1_PDSP_TX1_IRAM_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for pr1_pdsp_tx1_iram_pend" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_PDSP_TX0_IRAM_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for pr1_pdsp_tx0_iram_pend" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_RTU1_IRAM_ECC_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for pr1_rtu1_iram_ecc_pend" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_RTU0_IRAM_ECC_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for pr1_rtu0_iram_ecc_pend" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_RAM_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for pr1_ram_pend" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_PDSP1_IRAM_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for pr1_pdsp1_iram_pend" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_PDSP0_IRAM_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for pr1_pdsp0_iram_pend" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_DRAM1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for pr1_dram1_pend" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_DRAM0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for pr1_dram0_pend" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_ded_eoi_reg" acronym="BORG_ECC_AGGR__CFG__REGS_ded_eoi_reg" offset="0x13C" width="32" description="EOI Register">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_ded_status_reg0" acronym="BORG_ECC_AGGR__CFG__REGS_ded_status_reg0" offset="0x140" width="32" description="Interrupt Status Register 0">
		<bitfield id="PR1_PDSP_TX1_IRAM_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for pr1_pdsp_tx1_iram_pend" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP_TX0_IRAM_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for pr1_pdsp_tx0_iram_pend" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RTU1_IRAM_ECC_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for pr1_rtu1_iram_ecc_pend" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RTU0_IRAM_ECC_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for pr1_rtu0_iram_ecc_pend" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RAM_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for pr1_ram_pend" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP1_IRAM_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for pr1_pdsp1_iram_pend" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP0_IRAM_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for pr1_pdsp0_iram_pend" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_DRAM1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for pr1_dram1_pend" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_DRAM0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for pr1_dram0_pend" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_ded_enable_set_reg0" acronym="BORG_ECC_AGGR__CFG__REGS_ded_enable_set_reg0" offset="0x180" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="PR1_PDSP_TX1_IRAM_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for pr1_pdsp_tx1_iram_pend" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP_TX0_IRAM_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for pr1_pdsp_tx0_iram_pend" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RTU1_IRAM_ECC_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for pr1_rtu1_iram_ecc_pend" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RTU0_IRAM_ECC_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for pr1_rtu0_iram_ecc_pend" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_RAM_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for pr1_ram_pend" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP1_IRAM_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for pr1_pdsp1_iram_pend" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_PDSP0_IRAM_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for pr1_pdsp0_iram_pend" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_DRAM1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for pr1_dram1_pend" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="PR1_DRAM0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for pr1_dram0_pend" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_ded_enable_clr_reg0" acronym="BORG_ECC_AGGR__CFG__REGS_ded_enable_clr_reg0" offset="0x1C0" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="PR1_PDSP_TX1_IRAM_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for pr1_pdsp_tx1_iram_pend" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_PDSP_TX0_IRAM_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for pr1_pdsp_tx0_iram_pend" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_RTU1_IRAM_ECC_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for pr1_rtu1_iram_ecc_pend" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_RTU0_IRAM_ECC_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for pr1_rtu0_iram_ecc_pend" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_RAM_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for pr1_ram_pend" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_PDSP1_IRAM_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for pr1_pdsp1_iram_pend" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_PDSP0_IRAM_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for pr1_pdsp0_iram_pend" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_DRAM1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for pr1_dram1_pend" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="PR1_DRAM0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for pr1_dram0_pend" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_aggr_enable_set" acronym="BORG_ECC_AGGR__CFG__REGS_aggr_enable_set" offset="0x200" width="32" description="AGGR interrupt enable set Register">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable set for svbus timeout errors" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable set for parity errors" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_aggr_enable_clr" acronym="BORG_ECC_AGGR__CFG__REGS_aggr_enable_clr" offset="0x204" width="32" description="AGGR interrupt enable clear Register">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable clear for svbus timeout errors" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable clear for parity errors" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_aggr_status_set" acronym="BORG_ECC_AGGR__CFG__REGS_aggr_status_set" offset="0x208" width="32" description="AGGR interrupt status set Register">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status set for svbus timeout errors" range="3 - 2" rwaccess="R/WI"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status set for parity errors" range="1 - 0" rwaccess="R/WI"/>
	</register>
	<register id="BORG_ECC_AGGR__CFG__REGS_aggr_status_clr" acronym="BORG_ECC_AGGR__CFG__REGS_aggr_status_clr" offset="0x20C" width="32" description="AGGR interrupt status clear Register">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status clear for svbus timeout errors" range="3 - 2" rwaccess="R/WD"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status clear for parity errors" range="1 - 0" rwaccess="R/WD"/>
	</register>
</module>